{"data":{"item":{"title":"KONQUEST IS A GO! A short mission summary","description":{"description":"Nearly a year ago I embarked on a new venture, Konquest, and as the first version of the platform goes live with our Beta customers, I thought it a good time to put something out there explaining exactly what we’re doing."},"content":{"childContentfulRichText":{"html":"<p>Nearly a year ago I embarked on a new venture, Konquest, and as the first version of the platform goes live with our Beta customers, I thought it a good time to put something out there explaining exactly what we’re doing.</p><p><b>The Problem</b></p><p>It’s common knowledge that commission and bonus go hand in hand with sales. This is especially true of recruitment agencies, but what I’ve learned is that whilst these motivators are ever present, an efficient system to calculate, approve and payroll commissions is not. Almost every agency I’ve spoken with has a monstrous spreadsheet in use. Managing things this way is inefficient, often lacks transparency and is prone to errors - not to mention the whole thing becomes a right headache at any scale. </p><p>I found my own consultancy to have this headache even at a modest size and sought recommendations from the members of the Recruitment Directors Lunch Club - who have a solution for, literally, everything else - but, to my surprise there were no such recommendations. There are no such solutions. Everyone is managing it manually.</p><p><b>The Solution</b></p><p>I can see why no-one’s solved this problem, commission schemes and business rules vary widely from one business to the next, so accommodating everyone’s needs is one hell of a task. Fortunately, I’ve not been put off and actually see this challenge as the opportunity, and with the help of some fantastic beta customers, friends and partners we’ve developed Konquest; the worlds first platform to automate commission management for recruitment agencies; bringing things out of 1920 and into 2019! </p><p>Here’s how it works:</p><img src='//images.ctfassets.net/iisnpk0tsa92/7CvHheaZ9s7brIP4mtrbxl/fd129d805225c926d5ef169bab1eaabd/how-it-works.png' /><p><b></b></p><p><b>What&#39;s the Benefit?</b></p><p>I really think those doing this manually (99% of the market) are missing out. Here’s why:</p><ul><li><p>Automation - saving time is saving money. By automating your commissions process you’ll not only save yourself a pain each month, but you&#39;ll also save hundreds of man hours each year</p></li><li><p>Accuracy - automating the process minimises the possibility of an error - there’s little more demotivating for a sales person than being underpaid!</p></li><li><p>Transparency - having a transparent rewards system builds trust and loyalty with your team, and ensures they know exactly what&#39;s required for them to achieve their goals </p></li><li><p>Performance - as a consultant, being able to view realtime commission pipeline at the click of a button is a tremendous motivator - every sales person since the dawn of time has regularly sat and worked out what they’re getting paid, so they can spend it beforehand!</p></li></ul><p><b>Want to Know More?</b></p><p>Private Beta goes live this month, and whilst this phase is fully subscribed we’ll be going public shortly thereafter. If you’d like to get ahead of the queue and be one of the first to implement Konquest, or if you’d just like to know more, I’d love to chat - <a href=\"http://mailto:Carl@konquest.io/\">Carl@Konquest.io</a></p><p>Alternatively, you can subscribe for updates at <a href=\"http://www.konquest.io/\">http://www.Konquest.io</a> </p><p>Good to see you,</p><p>Carl. </p>"}},"headerImage":{"fluid":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAKCAMAAACDi47UAAABVlBMVEW0GR20Gh61Gh61Gx/OZ2q2HCC2Gx+3HCC6ICS8LjL57Oy4HSG5HyK5HyO5HiLBJiq4HiK3HSHnsrT///+6HyO8ISXHLDC9Iye7ICTRaGvDKS3CKCy/JSnCJyvBJyvKLzPRNjrDKCy9Iia7ISXAMjX56+zKMDTLMDTPNDjJLjLQNTnWPEDGLDDAJSm+Iye8IibnsrP89fXeiYn89vbUWl3abnHYY2bVYGPWYGPbaGvZV1rLR0vJSEvPXmHMVFfRaGruwsPVaWnNTk789fbdiIrhlZfmnJ7ln6Haf4Lcf4LZYmXTaGrVc3bgmJrWdnnCMzf56uvRXF3afH3MS0vTYGPbdHfbd3rVZmnefH7ceXzcbXDegYPWc3bXcHLDLzPFKy/qs7X9+Pnhk5P89PTvxsb99vbNMjbJLzPOMzfAJirNMzbHLTHab3L13Nzoq6vmpabtvL356Onui3c/AAAACXBIWXMAABcRAAAXEQHKJvM/AAAAB3RJTUUH4wQLEQoHB+pWIwAAAJBJREFUCB1Nwb0OwVAAhuHvdU5/Uj3NGSQWLsAkEoPFVbsBV2AQi8UkJhFDSdrSaiMaz4OQEPoDRgMkaGokNRIGG/MKalNGtanCp4ZlKDAxJioSojAwlbUNhavFKOTncU9zn3ITkwTxlbtLJkdrHtA7S1Na9jqjd9SK1sm+Pb3xgs5yoN3Be+/22dbFa7dJOx9IOyBppEDnwAAAAABJRU5ErkJggg==","aspectRatio":1.910828025477707,"src":"//images.ctfassets.net/iisnpk0tsa92/1oEVqFLpdc4Z9Cryqj5dRf/2e16dc88a5736b51b3af8b045b9da724/blog-header.png?w=978&q=50","srcSet":"//images.ctfassets.net/iisnpk0tsa92/1oEVqFLpdc4Z9Cryqj5dRf/2e16dc88a5736b51b3af8b045b9da724/blog-header.png?w=245&h=128&q=50 245w,\n//images.ctfassets.net/iisnpk0tsa92/1oEVqFLpdc4Z9Cryqj5dRf/2e16dc88a5736b51b3af8b045b9da724/blog-header.png?w=489&h=256&q=50 489w,\n//images.ctfassets.net/iisnpk0tsa92/1oEVqFLpdc4Z9Cryqj5dRf/2e16dc88a5736b51b3af8b045b9da724/blog-header.png?w=978&h=512&q=50 978w,\n//images.ctfassets.net/iisnpk0tsa92/1oEVqFLpdc4Z9Cryqj5dRf/2e16dc88a5736b51b3af8b045b9da724/blog-header.png?w=1200&h=628&q=50 1200w","sizes":"(max-width: 978px) 100vw, 978px"}}},"recent":null},"pageContext":{"id":"370f794b-8744-53c0-8324-4bf73dc5d49c"}}